'=================================Git====================================='
#Git - это распределенная система контродя версий. Система для отслеживания и ведения 
#истории изменения файлов в нашем проекте. При помощи git можно организовать командную работу
#РЕПОЗИТОРИЙ - это хранилище нашего кода и истории его изменений 
#Github - это вебсайт для размещения git - репрозиториев для совместной разработке проектов.


'''
git add . - добавит все файлы в индекс
git commit -m 'comment' - зафиксировать изменения
'''