# # # =======================================условия====================================
# # # Логические операторы - это выражения, которые возвращают True, если выражение верно и false - если не верно

# # # print(55 == 55)

# # # 'равенство' . . . . . 'не равенство'
# # # 5==5 True              4 != 5 True
# # # 4==5 False             4 != 4 False

# # # 'больше'.............. 'больше или равно'
# # # # 5 > 4  True............ 5>= 10 false
# # # 5 > 10 False............. 5 >= 4 True
# # # 5 > 5 False..............5 >= 5 True
# # # 'меньше'.................. 'меньше или равно'
# # # 3 > 5 False................ 5 <= 10 true
# # # 3 < 2 True................. 5 <= 4 false
# # # 5 < 5 False................ 5 <= 5 true


# # '==================================and, or, not ======================================'
# # #and = и 
# # #or = или
# # #not = нет

# # and
# # a = 5
# # b = 6
# # print(a == 5 and a == 6)
# # print(a == 5 and b == 7)
# # print(a == 1 and b == 1)
# # #or
# # print(a == 5 or b == 6) #true
# # print(a == 5 or b == 2) True

# # #not
# # not True
# # not False
# # #================================== приоритет операторов========================================
# # 1 всегда первым будет выполнятся частичка not
# # 2 вторым по вадности будет and 
# # 3 последний в приоритете будет or

# # =================================== Boolean Type ==============================================
# # Булевые тип данныз имеет только 2 значение: true or false
# print(bool(1)) #True
# print(bool(0)) #False
# print(bool('')) #false
# print(bool(' ')) #true
# print(bool([[]])) #true
# print(bool([])) #false
# # '=======================================None Type==================================================
# # # None - неизменяемый тип данных с одним значением Nonе, который используется для обозначения отсутсвия значения, 
# # иначе говоря ПУСТОТА
# print(bool(None))
# print(bool('None'))
# # ===========================================условные операторы========================================
# # Условные операторы конструкция,  используется для того чтобы создать структуру 
# #условий для взодныз данных для разныъ событий
# answer = input('какой язык прог мы изучаем: ')
# if answer == 'Python':
#     print('верно')
# else:
#     print("Не совсем так!")
# # Отсуп сообщает где начинается и где заканчивается блок кода
# number = int(input("введите число: "))
# if number == 1: 
#     print('Вы ввели число 1')
# elif number == 2:
#     print('Вы ввели число 2')
# elif number == 3:
#     print('Вы ввели число 3')
# else:
#     print('Вы ввели число 4')
#  в одной конструкции может быть только один if
#  в одной конструкции может быть много elif либо вообще отсутствовать
# #  в одной конструкции может быть лишь один else либо вообще не быть
# word = input("Напишите любой ЯП: ")
# if word == 'Python':
#     print("да")
# else:
#     print("нет")


# number = int(input('Напиши любое число'))
# if number == 11 or 22 or 33 or 44 or 55 or 66 or 77 or 88 or 99:    
#     print("да")
# else:
#     print('нет')

# number = int(input('Напишите любое число'))
# num10 = number % 10
# num20 = number // 10
# if num10 == num20:
#     print('da')
# else:
#     print('net')
# ====================================== Цепочки сравнений =================================
# number = int(input())
# if number == 22 or number == 33 or number == 44:
#     print('да')
# age = int(input())
# if 3 <= age <= 6:
#     print('вы ребенок')
# elif 
# password = input("Введите новый пароль: ")
# password2 = input("подтвердите новый пароль: ")
# if password == password2:
#     print("Вы обновили ваш пароль")
# else:
#     print("пароли не совпадают: ")
# number = int(input("vvedite znachenoe chislo: "))
# number2 = number % 2
# if number2 == 0:
#     print("четное число")
# else:
#     print("нечетное число")
number = int(input("4 chislo: "))
number4 = number % 10
number3 = number % 100 // 10
number2 = number % 1000 // 100
number1 = number % 10000 // 1000
counter = number1 + number4
counter2 = number2 - number3
if counter == counter2:
    print("da")
else:
    print("net")